Revit 2024 API
InitialWattageIntensity Class
 This class encapsulates initial wattage intensity calculation.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class InitialWattageIntensity : InitialIntensity
Visual Basic
Public Class InitialWattageIntensity _
	Inherits InitialIntensity
Visual C++
public ref class InitialWattageIntensity : public InitialIntensity
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialWattageIntensity
See Also
InitialWattageIntensity Members
Autodesk.Revit.DB.Lighting Namespace